// Ques: 62 圆圈中最后剩下的数字
// Author: chukexin - 2022-07-31

// 约瑟夫环问题
// n = 2, m = 3
// 0 1 "2" 3 4 | 0 1 2 3 4  => 删除2
// "0" 1 3 4 | 0 1 3 4      => 删除0
// 1 3 "4" | 1 3 4          => 删除4
// 1 3 | "1" 3              => 删除1

// 逆向求解: <第m个被删除>
// 第 n 步，只有最后一个元素，下标pos为0
// 第 n-1 步，2个元素，则活下来的结果下标为 (0 + m) % 2  <循环，所以需要%2>;
// 第 n-2 步，3个元素，也活了下来: pos = ((0 + m) % 2 + m) % 3
// ... ...
// 第 1 步，有n个元素，循环计算pos

class Solution
{
public:
    int lastRemaining(int n, int m)
    {
        int res = 0;
        for (int i = n - 1; i > 0; i--)
        {
            res = (res + m) % (n + 1 - i);
        }
        return res;
    }
};